app/Http/Controllers/Admin/PostController.php

select * from `posts` order by `id` desc
---
    public function index()
    {
        $posts = Post::orderBy('id','desc')->get();

insert into `posts` (`name`, `content`, `created_by`, `updated_at`, `created_at`) values ('Test Post', 'Hello This is A test Post', 'Nikumani Choudhury', '2022-07-24 06:36:13', '2022-07-24 06:36:13')
---
    public function store(Request $request)
    {
        try {
            $request->validate([
                'name' => 'required|unique:posts,name',
            ]);
            $post = Post::create([
                'name'=> $request['name'],
                'content'=> $request['content'],
                'created_by'=> $request['created_by'],
            ]);

select * from `posts` where `posts`.`id` = '1' limit 1
---
    public function edit($id)
    {
        $post = Post::find($id);

select * from `posts` where `posts`.`id` = '1' limit 1
---
    public function update(Request $request, $id)
    {
        try {
            $post=Post::findOrFail($id);